import random


def make_name():
    name_list = []
    fu_name_list = ['上官', '欧阳', '太史', '司马', '东方', '独孤', '南宫', '诸葛', '公孙',
                    '钟离', '宇文', '司徒', '令狐', '夏侯', '西门', '轩辕', '东郭', '尉迟',
                    '呼延', '端木', '乐正', '司空', '羊舌', '微生', '左丘', '公皙', '皇甫']
    f_name_str = """
    赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章
    云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常
    乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞
    熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍
    虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁
    荀羊於惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫
    宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙
    池乔阴鬱胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍卻璩桑桂濮牛寿通边扈燕冀郏浦尚农
    温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东
    欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后荆红
    游竺权逯盖益桓公万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫尉迟公羊澹台公冶宗政濮阳
    淳于单于太叔申屠公孙仲孙轩辕令狐钟离宇文长孙慕容鲜于闾丘司徒司空丌官司寇仉督子车
    颛孙端木巫马公西漆雕乐正壤驷公良拓跋夹谷宰父谷梁晋楚闫法汝鄢涂钦段干百里东郭南门
    呼延归海羊舌微生岳帅缑亢况郈有琴梁丘左丘东门西门商牟佘佴伯赏南宫墨哈谯笪年爱阳佟
    """
    s_name_str = """
    悦昭冰爽琬茗羽希宁萱昊芸天岚乾亦雅芝烨
    欣飘育涵琴晴丽美瑶梦茜倩希夕月悦乐彤影
    珍依沫玉灵瑶嫣倩妍萱漩娅媛怡佩淇雨娜莹
    娟文芳莉雅芝文晨宇怡全子凡悦思奕英义卿
    钊钧铎铭皑柏镇淇淳一洁茹清吉克先依浩泓
    亮允元源渊和函妤宜云琪菱宣沂健信媛凯伊
    欣可洋萍荣榕含佑明雄芝亚宜可桂娣叶璧璐
    娅琦妍茜秋珊莎锦琬茗羽伊宁飘黛青婷娴瑾
    露瑶婵雁蓓纨仪冰爽昭寒丹蓉安晨曦璨炯泽
    润宁童慈瑶嫣倩妍萱漩娅媛怡佩淇雨娜莹娟文聪婷  
    """
    l_name_str = """
    梦琪忆柳之桃慕青问兰尔岚元香初夏沛菡傲珊曼文乐菱
    痴珊恨玉惜文香寒新柔语蓉海安夜蓉涵柏水桃醉蓝春儿
    语琴从彤傲晴语兰又菱碧彤元霜怜梦紫寒妙彤曼易南莲
    紫翠雨寒易烟如萱若南寻真晓亦向珊慕灵以蕊寻雁映易
    雪柳孤岚笑霜海云凝天沛珊寒云冰旋宛儿绿真盼儿晓霜
    碧凡夏菡曼香若烟半梦雅绿冰蓝灵槐平安书翠翠风香巧
    代云梦曼幼翠友巧听寒梦柏醉易访旋亦玉凌萱访卉怀亦
    笑蓝春翠靖柏夜蕾冰夏梦松书雪乐枫念薇靖雁寻春恨山
    从寒忆香觅波静曼凡旋以亦念露芷蕾千兰新波代真新蕾
    雁玉冷卉紫山千琴恨天傲芙盼山怀蝶冰兰山柏翠萱恨松
    问旋从南白易问筠如霜半芹丹珍冰彤亦寒寒雁怜云寻文
    乐丹翠柔谷山之瑶冰露尔珍谷雪乐萱涵菡海莲傲蕾青槐
    冬儿易梦惜雪宛海之柔夏青亦瑶妙菡春竹痴梦紫蓝晓巧
    幻柏元风冰枫访蕊南春芷蕊凡蕾凡柔安蕾天荷含玉书兰
    雅琴书瑶春雁从安夏槐念芹
    """
    name1 = random.choice(''.join(f_name_str.split())) + random.choice(''.join(s_name_str.split())) + random.choice(''.join(l_name_str.split()))
    name2 = random.choice(''.join(f_name_str.split())) + random.choice(''.join(s_name_str.split()))
    name3 = random.choice(fu_name_list) + random.choice(''.join(s_name_str.split())) + random.choice(''.join(l_name_str.split()))
    name4 = random.choice(fu_name_list) + random.choice(''.join(l_name_str.split()))
    name5 = random.choice(fu_name_list) + random.choice(''.join(s_name_str.split()))
    name_list.append(name1)
    name_list.append(name2)
    name_list.append(name3)
    name_list.append(name4)
    name_list.append(name5)
    name = random.choice(name_list)
    return name

